---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentBaseReferencedend
source: html/45fa9cae-1a26-a345-49e2-03642098e0ba.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentBaseReferencedend Property

"Base Attachment Referenced End"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAttachmentBaseReferencedend { get; }
```